Revit 2024 API
ExportLineweightTableIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual KeyValuePair<ExportLineweightKey, ExportLineweightInfo> Current { get; }
Visual Basic
Public Overridable ReadOnly Property Current As KeyValuePair(Of ExportLineweightKey, ExportLineweightInfo)
	Get
Visual C++
public:
virtual property KeyValuePair<ExportLineweightKey^, ExportLineweightInfo^> Current {
	KeyValuePair<ExportLineweightKey^, ExportLineweightInfo^> get ();
}
Implements
IEnumerator<T>.Current
Remarks
There is no current item if the iterator has not started yet or has been done.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  There is no current item in the iterator.
See Also
ExportLineweightTableIterator Class
Autodesk.Revit.DB Namespace